Revit 2027 API
ParameterTypeId.FamilyExportAsGeometry Property
 "Always export as geometry"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FamilyExportAsGeometry { get; }
Public Shared ReadOnly Property FamilyExportAsGeometry As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FamilyExportAsGeometry {
	ForgeTypeId^ get ();
}
static member FamilyExportAsGeometry : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace